[
    {"id": 1, "text": "The quick brown fox jumps over the lazy dog."},
    {"id": 2, "text": "A journey of a thousand miles begins with a single step."},
    {"id": 3, "text": "To be or not to be, that is the question."},
    {"id": 4, "text": "All that glitters is not gold."},
    {"id": 5, "text": "In the middle of difficulty lies opportunity."},
    {"id": 6, "text": "The only limit to our realization of tomorrow is our doubts of today."},
    {"id": 7, "text": "Life is 10% what happens to us and 90% how we react to it."},
    {"id": 8, "text": "The future belongs to those who believe in the beauty of their dreams."},
    {"id": 9, "text": "Success is not the key to happiness. Happiness is the key to success."},
    {"id": 10, "text": "You miss 100% of the shots you don’t take."},
    {"id": 11, "text": "The best way to predict the future is to create it."},
    {"id": 12, "text": "Do not wait to strike till the iron is hot, but make it hot by striking."},
    {"id": 13, "text": "What lies behind us and what lies before us are tiny matters compared to what lies within us."},
    {"id": 14, "text": "The only way to do great work is to love what you do."},
    {"id": 15, "text": "Believe you can and you're halfway there."},
    {"id": 16, "text": "Act as if what you do makes a difference. It does."},
    {"id": 17, "text": "Success usually comes to those who are too busy to be looking for it."},
    {"id": 18, "text": "Opportunities don't happen. You create them."},
    {"id": 19, "text": "Don't watch the clock; do what it does. Keep going."},
    {"id": 20, "text": "The way to get started is to quit talking and begin doing."},
    {"id": 21, "text": "If you can dream it, you can do it."},
    {"id": 22, "text": "It does not matter how slowly you go as long as you do not stop."},
    {"id": 23, "text": "You are never too old to set another goal or to dream a new dream."},
    {"id": 24, "text": "Your time is limited, so don’t waste it living someone else’s life."},
    {"id": 25, "text": "The best revenge is massive success."},
    {"id": 26, "text": "Success is walking from failure to failure with no loss of enthusiasm."},
    {"id": 27, "text": "I find that the harder I work, the more luck I seem to have."},
    {"id": 28, "text": "The only place where success comes before work is in the dictionary."},
    {"id": 29, "text": "If you want to achieve greatness stop asking for permission."},
    {"id": 30, "text": "Dream big and dare to fail."},
    {"id": 31, "text": "The only way to achieve the impossible is to believe it is possible."},
    {"id": 32, "text": "Success is not in what you have, but who you are."},
    {"id": 33, "text": "What we fear doing most is usually what we most need to do."},
    {"id": 34, "text": "The future depends on what you do today."},
    {"id": 35, "text": "You cannot swim for new horizons until you have courage to lose sight of the shore."},
    {"id": 36, "text": "Success is not how high you have climbed, but how you make a positive difference to the world."},
    {"id": 37, "text": "The only limit to our realization of tomorrow is our doubts of today."},
    {"id": 38, "text": "What you get by achieving your goals is not as important as what you become by achieving your goals."},
    {"id": 39, "text": "You don’t have to be great to start, but you have to start to be great."},
    {"id": 40, "text": "Success is not the result of spontaneous combustion. You must set yourself on fire."}
]
